Tekla Open API Reference for Tekla Structures 2025
ModelObject.SetPhase Method
 Sets the phase of the model object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetPhase(
	Phase phase
)
Public Function SetPhase (
	phase As Phase
) As Boolean
Parameters
phase
Type: Tekla.Structures.Model.Phase
The new phase. A phase with this phase's number must exist in the database.
Return Value
Type: Boolean
True on success.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace